app/Controllers/Auth.php

    public function signinPost()
    {
      $model = new UserModel();
      $email = $this->request->getVar('email');
      $password = $this->request->getVar('password');
      $result = $model->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'email@01'
 LIMIT 1

    public function signupPost()
    {
      helper('form');

      if (! $this->validate([
        'name' => 'required|max_length[100]|min_length[2]',
        'email'  => 'required|max_length[255]',
        'password'  => 'required|max_length[255]|min_length[8]',
        'confirm-password'  => 'required|max_length[255]|min_length[8]',
        ])) {
          // The validation fails, so returns the form.
          $validation = \Config\Services::validation();
          $data['display'] = '';
          $data['msg'] = $validation->getErrors();
          $data['signinActive'] = '';
          $data['signupActive'] = 'active-tab';
          return view('templates/header').view('templates/navbar').view('templates/switchTab',$data).view('pages/signup').view('templates/footer');
        }

        $model = new UserModel();

        $name = $this->request->getVar('name');
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $cnfPassword = $this->request->getVar('confirm-password');

        $result = $model->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'lalu.yadav@gmail.com'
 LIMIT 1