app/Controllers/Home.php

    public function index()
    {
        $session = session();
        if($session->get('id')) {
            $model = new UserModel();
            $result = $model->where('id',$session->get('id'))->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1